<script setup>

import { RouterLink } from 'vue-router';
</script>

<template>
    <RouterLink to="/game" class="flex justify-center items-center min-h-screen bg-gray-900 p-4 text-gray-100">
        <div class="bg-gray-800 bg-opacity-90 shadow-lg rounded-lg border border-gray-600 p-10 max-w-3xl w-full text-center text-shadow-md">
            <h1 class="text-4xl font-bold text-amber-500 tracking-wide mb-6">История</h1>
            <p class="text-lg leading-relaxed text-gray-300">
                Вы просыпаетесь посреди ночи в своем доме, и что-то кажется не таким, как раньше. 
                Тишина слишком зловещая, а воздух пропитан страхом. Вы не можете вспомнить, как оказались здесь, но одно ясно: в доме кто-то еще. 
                Или… что-то еще. <br/><br/>
                Выходите из комнаты и чувствуете — что-то в вашем доме не так. Каждый угол, каждая тень таит угрозу. 
                Каждая дверь ведет в случайную комнату, и вы не знаете, что за ней. Иногда там пусто, но иногда в комнате сидит монстр — огромный, злобный и настороженный. 
                Он не любит, когда кто-то вторгается в его территорию, и отбирает жизнь у тех, кто осмеливается зайти без приглашения. <br/><br/>
                Ваша цель проста: выбраться из дома, отыскать нужный выход. Но будьте осторожны. Вам придется прислушиваться к звукам за дверью и использовать чутье, чтобы не зайти в комнату с монстром. 
                Иначе вы потеряете одну из своих жизней, а шансы найти выход станут меньше. <br/><br/>
                Сможете ли вы выбраться из ловушки в собственном доме, прежде чем монстры отнимут у вас все жизни?
            </p>
        </div>
    </RouterLink>
</template>

<style scoped>
.text-shadow-md {
    text-shadow: 2px 2px 4px rgba(0, 0, 0, 0.6);
}
</style>
